//-----------------------------------------------------------------------------
// タスク管理アプリ/タスクオブジェクトデータクラス
// 作　成　者：長谷川英一
// 作成年月日：2023/3/21
// 機　　　能：タスクファイルの読み込み
//-----------------------------------------------------------------------------
#pragma once

#include "TaskManagement.h"
class TaskObject
{
	Vec2 pos;               //タスクの場所
	int32 taskID;           //タスクID
	TaskManagement taskDate;//タスクデータ

	RectF taskBox;			//オブジェクト

	bool deadFlag;			//消滅するか？
	bool grip;				//つかまれているか？
	bool selected;			//選択中
public:
	using SP = std::shared_ptr<TaskObject>;
	using WP = std::weak_ptr<TaskObject>;

	//コンストラクト
	TaskObject(Vec2 pos_ = Vec2(10.0, 10.0), int32 taskId_ = 0, TaskManagement data_ = TaskManagement());

	//更新・描画処理
	void update();
	void draw();

	//-------------------------------------------------------------------------
	// タスクオブジェクト選択状態取得関数
	// 引数：なし
	// 戻り値：タスクオブジェクト選択状態＜bool型＞
	//-------------------------------------------------------------------------
	bool isSelect() const; //選択していたらtrue

	//-------------------------------------------------------------------------
	// タスクオブジェクト消滅状態取得関数
	// 引数：なし
	// 戻り値：タスクオブジェクト消滅状態＜bool型＞
	//-------------------------------------------------------------------------
	bool isDead() const;	//消滅するならtrue

	//-------------------------------------------------------------------------
	// タスクID取得関数
	// 引数：なし
	// 戻り値：タスクID＜int32型＞
	//-------------------------------------------------------------------------
	int32 GetTaskID() const;//タスクIDを取得

	//-------------------------------------------------------------------------
	// タスクオブジェクト座標取得関数
	// 引数：なし
	// 戻り値：タスクオブジェクト左上座標＜Vec2型＞
	//-------------------------------------------------------------------------
	Vec2 GetTaskPos() const;//タスクオブジェクトの座標を取得

	//-------------------------------------------------------------------------
	// タスクデータ取得関数
	// 引数：なし
	// 戻り値：タスクデータ＜TaskManagement型＞
	//-------------------------------------------------------------------------
	TaskManagement GetTaskDate() const;

	//-------------------------------------------------------------------------
	// タスクデータ設定関数
	// 引数：タスクデータ＜TaskManagement型＞
	// 戻り値：なし
	//-------------------------------------------------------------------------
	void SetTaskDate(TaskManagement date_);

	//-------------------------------------------------------------------------
	// タスクオブジェクト消滅設定関数
	// 引数：なし
	// 戻り値：なし
	//-------------------------------------------------------------------------
	void SetDead();

};


